//
// Реалізовуємо свій компютерний магазин.
// ===
// Необхідно реалізувати базовий клас комютера. Який має лише параметри:
//     Оперативна память.
//     Потужність процесора. (цифра від 0 до 1000)
// Назва.
//     В кожного компютера має бути метод включання.
// ===
// Від базового компютера треба реалізувати ноутбук.
//     Він має нову властивість дюймаж монітора.
//
//     У нього зявляється нова змінна роботи батареї. Ця змінна визначається як потужність / (дюйми * оперативку)
// ===
// Від ноутбука потрібно зробити ультрабук.
//     Він має нову змінну ваги.
//     При включенні ультрабуку має видаватися помилка, якшо вага більша за 2кг та батарея тримаж менше ніж 4 години.
// ===
// Від базвого класу потрібно створити базовий ПК.
//     В нього має бути новий метод запуску ігор.
//     Кількість FPS визначається як потужність / опервтивку.
//     Example: `You are playing *GAME_NAME* with *FPS_COUNT* FSP`
//
// Компютер можна апгрейдити.
//     Потужність процесора можна збільшувати максимум на 10%. Зменшувати її не можна.
//     Оперативку можна збільшити лише в 2 рази. Зменшувати її не можна.
//     Для зміни характеритик мають бути свої методи. Мняти змінну "в лоб" заборонено.
// ===
// Від базового ПК необхідно зробити ігровий ПК.
//     Кількість ФПС має бути рівно в 2 рази більший ніж в звичайного ПК.
//     При запуску однієї гри потужніть процесора має падати на 0.1%.
// Якшо потужність процесора менша ніж 500. І оперативка менша за 8 потрібно видати помилку, (алерт, або консоль)
// що на цьому відрі ігри не запускаються.


class Computer{

    constructor(ram, cpu_power, model) {
        this.ram = ram;
        if(cpu_power > 0 && cpu_power < 1000){
            this.cpu_power = cpu_power;
        }
        this.model = model;
    }
    turn_on(){
        console.log('Включився');
    }
}

class Laptop extends Computer{

    constructor(ram, cpu_power, model, diagonal) {
        super(ram, cpu_power, model);
        this.diagonal = diagonal;
        this.battery = cpu_power / (diagonal * ram);
    }
    turn_on() {
        super.turn_on();
        console.log('ноутбук');
    }
}

class Ultrabook extends Laptop{

    constructor(ram, cpu_power, model, diagonal, weight) {
        super(ram, cpu_power, model, diagonal);
        this.battery = cpu_power / (diagonal * ram);
        this.weight = weight;
    }
    turn_on() {
        if(this.weight > 2 && this.battery < 4){
            console.log('Error');
        }
        else{
            super.turn_on();
            console('ультрабук');
        }
    }
}