// 1) Створити масив з 20 чисел та:

// f) За допомогою map збільшити кожен елемент в масиві в три рази.
//     g) Порахувати загальну суму всіх елментів у масиві (reduce)

let mas = [61, 56, 57, 36, 41, 5, 27, 85, 51, 4, 48, 21, 64, 6, 16, 3, 55, 47, 2, 34];

//     a) відсортувати його від меншого до більшого.
mas.sort((a,b) => a - b);
console.log(mas);

//     b) відсортувати його від більшого до меншого.
mas.sort((a,b) => b - a);
console.log(mas);

//     c) Відфілтрувати числа які є кратними 3.
let filter = mas.filter(a => a % 3 === 0);
console.log(filter);

// d) Відфілтрувати числа які є більшими за 10.
let filter2 = mas.filter(a => a > 10);
console.log(filter2);

// e) Проітерувати його forEach та вивести кожеш елмент за допомогою document.write